app/controllers/admin/infos_controller.rb

SELECT "infos".* FROM "infos"  ORDER BY ordinal ASC
---
  def index
    #@infos = Info.all
    @infos = Info.order("ordinal ASC")

INSERT INTO "infos" ("title", "description", "ordinal", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "產品介紹"], ["description", "以復古不同年代發想，製作仿舊文具用品、旅遊配件、生活雜貨等商品。"], ["ordinal", 1], ["created_at", "2015-09-24 07:00:49.135994"], ["updated_at", "2015-09-24 07:00:49.135994"]]
---
  def create
    @info = Info.new(info_params)

    if @info.save

SELECT  "infos".* FROM "infos" WHERE "infos"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @info = Info.find(params[:id])

SELECT  "infos".* FROM "infos" WHERE "infos"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "infos" SET "title" = ?, "description" = ?, "ordinal" = ?, "updated_at" = ? WHERE "infos"."id" = ?
---
  def update
    @info = Info.find(params[:id])

    if @info.update(info_params)