app/controllers/admin/products_controller.rb

  def index
    #@products = Product.all
    @products = Product.order("id DESC")
---
SELECT "products".* FROM "products"  ORDER BY id DESC

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("title", "description", "quantity", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "r6"], ["description", "r6"], ["quantity", 1], ["price", 100], ["created_at", "2015-09-14 10:38:00.896285"], ["updated_at", "2015-09-14 10:38:00.896285"]]

  def update
    @product = Product.find(params[:id])

    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "products" SET "quantity" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["quantity", 0], ["updated_at", "2015-09-23 09:11:02.473199"], ["id", 6]]