app/controllers/account/orders_controller.rb

  def index
    #@orders = current_user.orders.order("id DESC")
    @orders = current_user.orders.recent
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  ORDER BY id DESC  [["user_id", 1]]