app/views/carts/checkout.html.erb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = 5 LIMIT 1  [["cart_id", 4]]
---
      <tbody>
        <% current_cart.items.each do |product| %>