app/views/carts/index.html.erb

      <tbody>
        <% current_cart.items.each do |product| %>
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = 6 LIMIT 1  [["cart_id", 4]]