app/controllers/infos_controller.rb

SELECT "infos".* FROM "infos"
SELECT  "infos".* FROM "infos" WHERE "infos"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @infos = Info.all
    @info = Info.find(params[:id])