app/controllers/orders_controller.rb

  def create
    @order = current_user.orders.build(order_params)

    if @order.save
---
INSERT INTO "orders" ("user_id", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?)  [["user_id", 1], ["created_at", "2015-09-14 16:27:42.629671"], ["updated_at", "2015-09-14 16:27:42.629671"], ["token", "6d174aad-7675-47c6-a656-528f1c40894b"]]

  def show
    @order = Order.find_by_token(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT 1  [["token", "19522772-9481-4534-b12a-621d4e5e0f90"]]

  def pay_with_credit_card
    @order = Order.find_by_token(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT 1  [["token", "19522772-9481-4534-b12a-621d4e5e0f90"]]