app/controllers/products_controller.rb

SELECT "products".* FROM "products"  ORDER BY id DESC
SELECT "infos".* FROM "infos"
---
  def index
    #@products = Product.all
    @products = Product.order("id DESC")
    @infos = Info.all

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 6]]
SELECT  1 AS one FROM "products" INNER JOIN "cart_items" ON "products"."id" = "cart_items"."product_id" WHERE "cart_items"."cart_id" = ? AND "products"."id" = ? LIMIT 1  [["cart_id", 2], ["id", 6]]
---
  def add_to_cart
    @product = Product.find(params[:id])
    #current_cart.add_product_to_cart(@product)

    if !current_cart.items.include?(@product)